# Решение различных задач

### Задача №1

Преподаватель отправил студентам ведомости с оценками за экзамен.

Максимальный балл за экзамен — 100. Определите количество студентов, сдавших экзамен на отлично (50 баллов и выше), хорошо (35–49 баллов) и неудовлетворительно (менее 35 баллов).

**Формат ввода:**

**Одна строка:** целые числа, разделенные запятыми, означающие баллы учеников (1 ≤ x ≤ 100).

**Формат вывода:**

**Количество студентов по категориям:** Отлично, Хорошо и Неудовлетворительно.

Каждая группа должна начинаться с новой строки, и выдаваться в формате «Оценка: 3» (без кавычек), где цифра — количество студентов, получивших эту оценку.

Если никто не набрал баллы в определенной категории, будет «Оценка: 0» (без кавычек).
```
Пример №1

Входные данные:

0,40,55,34

Выходные данные:

Отлично: 1

Хорошо: 1

Неудовлетворительно: 2
```
```
Пример №2

Входные данные:

55,55,55,55,55,55

Выходные данные:

Отлично: 6

Хорошо: 0

Неудовлетворительно: 0
```
```python
def categorize_students(scores_input: str)-> str:
    """Ваш код"""

scores_input = input()
result = categorize_students(scores_input)
print(result)
```

### Решение задачи №1

```python
def categorize_students(scores_input: str) -> str:
    scores = list(map(int, scores_input.split(',')))  # Преобразуем входные данные в список чисел
    excellent = sum(1 for score in scores if score >= 50)  # Отлично: 50 и выше
    good = sum(1 for score in scores if 35 <= score <= 49)  # Хорошо: от 35 до 49 включительно
    unsatisfactory = sum(1 for score in scores if score < 35)  # Неудовлетворительно: меньше 35

    result = (
        f"Отлично: {excellent}\n"
        f"Хорошо: {good}\n"
        f"Неудовлетворительно: {unsatisfactory}"
    )
    
    return result

# Пример использования:
scores_input = input()
result = categorize_students(scores_input)
print(result)
```

**Объяснение:**

- Входная строка с оценками преобразуется в список целых чисел.
- Для каждой категории (отлично, хорошо, неудовлетворительно) считаются студенты, используя функцию sum с условиями.
- Возвращается форматированная строка с количеством студентов для каждой категории.

.

.

.

### Задача №2

Вы разрабатываете интерактивный учебник по математике для 7-го класса: работаете над заданиями к теоретическим главам по геометрии.

Напишите программу для расчета площади и периметра прямоугольника по его длине и ширине.

**Формат ввода:**
Два положительных целых числа a и b (1 <= a, b <= 1000), разделенных пробелом — это длина и ширина прямоугольника.

**Формат вывода:**
Два числа, разделенные пробелом: сначала площадь, затем периметр прямоугольника.

```
Пример 1

Входные данные:

3 5

Выходные данные:

15 16
```
```
Пример 2

Входные данные:

10 7

Выходные данные:

70 34
```
```python
def calculate_rectangle_area_perimeter(dimensions: str) -> str:
    """Ваш код"""

dimensions = input()
result = calculate_rectangle_area_perimeter(dimensions)
print(result)
```

### Решение задачи №2
**Программа для расчета площади и периметра прямоугольника:**
```python
def calculate_rectangle_area_perimeter(dimensions: str) -> str:
    a, b = map(int, dimensions.split())  # Преобразуем строку в два целых числа
    area = a * b  # Площадь: длина * ширина
    perimeter = 2 * (a + b)  # Периметр: 2 * (длина + ширина)

    return f"{area} {perimeter}"  # Возвращаем результат в формате "площадь периметр"

# Пример использования:
dimensions = input()
result = calculate_rectangle_area_perimeter(dimensions)
print(result)
```

**Объяснение:**

- Входная строка преобразуется в два числа — длину и ширину прямоугольника.

- Площадь вычисляется как произведение длины и ширины.

- Периметр вычисляется по формуле P=2×(a+b).

- Результат выводится в виде двух чисел через пробел.

.

.

.

### Задача №3

Узнать номер карты или телефон человека иногда можно,просто заглянув ему через плечо.

Чтобы обезопасить своих пользователей, разработчики скрывают эти данные, оставляя только последние цифры.

**Ваша задача — написать функцию, которая преобразует все символы, кроме последних четырех, в «#» (решетку).**

**Формат ввода**

Одна строка произвольных символов, обозначающих, например, номер карты, телефон человека или ключ доступа API.

Длина строки — не больше 100 символов. В строке гарантированно отсутствуют пробелы.

**Формат вывода**

Одна строка, в которой содержатся решётки и четыре цифры или буквы. Если длина строки меньше 4 символов, выведите всё, что было изначально.

```
Пример 1

Входные данные:

123456789

Выходные данные:

#####6789
```
```
Пример 2

Входные данные:

abc

Выходные данные:

abc
```

```python
def mask(string_to_mask: str) -> str:
  """Ваш код"""

string_to_mask = input()
result = mask(string_to_mask)
print(result)
```

### Решение задачи №3
**Функция, которая маскирует все символы, кроме последних четырех:**
```python
def mask(string_to_mask: str) -> str:
    # Если длина строки меньше 4, возвращаем строку без изменений
    if len(string_to_mask) < 4:
        return string_to_mask
    # Возвращаем строку, где все символы, кроме последних 4, заменены на '#'
    return '#' * (len(string_to_mask) - 4) + string_to_mask[-4:]

# Пример использования:
string_to_mask = input()
result = mask(string_to_mask)
print(result)
```

**Объяснение:**

- Если длина строки меньше 4 символов, функция возвращает строку без изменений.
- Если длина строки 4 или больше, все символы, кроме последних четырёх, заменяются на #, а последние четыре символа остаются неизменными.


.

.

.


💼 **Автор:** Дуплей Максим Игоревич

📲 **Telegram:** @quadd4rv1n7

📅 **Дата:** 07.09.2024

▶️ **Версия 1.0**

```
※ Предложения по сотрудничеству можете присылать на почту ※
📧 maksimqwe42@mail.ru
```